"Cancel" = "Cancel";
"OK" = "OK";
"Removing Input Methods requires logout, do you want to continue?" = "Removing Input Methods requires logout, do you want to continue?";
"You did not selected any Input Method." = "You did not selected any Input Method.";